app/views/comments/index.html.erb

            <p class="comment-text">
              <% topic.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`topic_id` = 1