app/views/topics/index.html.erb

SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`topic_id` IN (1, 2, 3, 4, 5, 6, 7)
---

            <% if !topic.favorite_users.include?(current_user) %>

SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`topic_id` IS NULL
---

            <%= topic.favorite_users.count %>