app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments`
---
  def index
    @comments = Comment.all

INSERT INTO `comments` (`user_id`, `topic_id`, `body`, `created_at`, `updated_at`) VALUES (12, 1, 'ahhhh', '2019-03-26 10:32:29', '2019-03-26 10:32:29')
---
  def create
  @comment = current_user.comments.new(comment_params)
  @comment.user_id = current_user.id
  @comment.topic_id = params[:topic_id]

    if @comment.save