app/controllers/favorites_controller.rb

INSERT INTO `favorites` (`user_id`, `topic_id`, `created_at`, `updated_at`) VALUES (12, 1, '2019-03-28 08:59:45', '2019-03-28 08:59:45')
---
  def create
    favorite = Favorite.new
    favorite.user_id = current_user.id       # favorite.user_idに現在ログインしているuser(current_user)のidを保存
    favorite.topic_id = params[:topic_id]    # params[]はリクエストからコントローラーで値を受け取るときに使う

    if favorite.save

SELECT  `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 12 AND `favorites`.`topic_id` = 1 LIMIT 1
DELETE FROM `favorites` WHERE `favorites`.`id` = 1
---
  def destroy
    favorite = Favorite.find_by(user_id:current_user.id, topic_id:params[:topic_id])
    favorite.destroy