app/controllers/topics_controller.rb

  def index
    @topics = Topic.all.includes(:favorite_users)  #全記事の一覧
---
SELECT `topics`.* FROM `topics`

  def create
    @topic = current_user.topics.new(topic_params)

    if @topic.save
---
INSERT INTO `topics` (`user_id`, `description`, `image`, `created_at`, `updated_at`) VALUES (12, 'ooo', 'pic-3.jpg', '2019-03-25 10:00:09', '2019-03-25 10:00:09')